<?php

namespace App\Livewire;

use Livewire\Component;

class FAQ extends Component
{
    public $faqs = [
        [
            'id' => 1,
            'question' => 'বনভূমি সরের ঘি অন্যান্য ঘি থেকে কেন আলাদা?',
            'answer' => 'বনভূমি ঘি তৈরি হয় শুধুমাত্র দেশি গরুর দুধ জ্বাল দিয়ে, সেই দুধের উপর থেকে সর সংগ্রহ করে ঐতিহ্যবাহী বিলোনা পদ্ধতিতে। যেখানে বাজারের অধিকাংশ ঘি তৈরি হয় কাঁচা দুধের ক্রিম সেপারেশন করে। সর থেকে ঘি তৈরির ফলে এর স্বাদ, ঘ্রাণ ও পুষ্টিগুণ অন্যান্য ঘি থেকে অনেক বেশি সমৃদ্ধ।',
            'open' => false
        ],
        [
            'id' => 2,
            'question' => 'বাজারের অন্য ঘি থেকে বনভূমি সরের ঘি এর দাম বেশি কেন?',
            'answer' => 'দুধ জ্বাল দিয়ে সর সংগ্রহে বেশি সময়, শ্রম ও দুধ লাগে। তাই দাম তুলনামূলক বেশি। তবে এর স্বাদ ও ঘ্রাণ এতটাই সমৃদ্ধ যে, কম পরিমাণেই বেশি ফল দেয়—ফলে আসলে এটি আরও সাশ্রয়ী।',
            'open' => false
        ],
        [
            'id' => 3,
            'question' => 'বনভূমি ঘি কি শিশু ও বৃদ্ধদের জন্য নিরাপদ? আর খেলে কি ওজন বাড়বে?',
            'answer' => 'হ্যাঁ, এটি শিশুদের বৃদ্ধি ও মস্তিষ্কের বিকাশে সহায়ক এবং বয়স্কদের হজমশক্তি ও হাড়ের জন্য উপকারী। সঠিক পরিমাণে খেলে কখনোই ওজন বাড়ে না; বরং শরীরের প্রয়োজনীয় স্বাস্থ্যকর ফ্যাট সরবরাহ করে।',
            'open' => false
        ],
        [
            'id' => 4,
            'question' => 'বনভূমি ঘি কি ফ্রিজে সংরক্ষণ করতে হবে?',
            'answer' => 'না, ফ্রিজে রাখার দরকার নেই। ঠাণ্ডা ও শুকনো জায়গায়, ঢাকনা ভালোভাবে বন্ধ করে রাখলেই দীর্ঘদিন পর্যন্ত ভালো থাকবে।',
            'open' => false
        ],
        [
            'id' => 5,
            'question' => 'এটা যে সরের ঘি সেটা কিভাবে বুঝবো?',
            'answer' => 'বনভূমি সরের ঘি যখন আপনি হাতে পাবেন, তখনই এর স্বাদ ও ঘ্রাণ আপনাকে মুগ্ধ করবে। ফলে সহজেই বুঝতে পারবেন।',
            'open' => false
        ]
    ];

    public function render()
    {
        return view('livewire.faq');
    }
}